Repository: bastos-rcd/FlOpEdt
Catalog: FlOpEDT/locale/*/LC_MESSAGES/django.po
Languages: fr

source: French
fr: Français

source: English
fr: Anglais

source: Spanish
fr: Espagnol

source: Arabic
fr: Arabe

source: Corsican
fr: Corse

source: Danish
fr: Espagnol

source: German
fr: Allemand

source: Dutch
fr: Néerlandais

source: Greek
fr: Grec

source: Italian
fr: Italien

source: Norwegian
fr: Norvégien

source: Polish
fr: Polonais

source: Portuguese
fr: Portugais

source: Swedish
fr: Suédois

source: Chinese
fr: Chinois

source: Smurf
fr: Schtroumpf

source: Is active?
fr: est active

source: Limited room choices
fr: Choix de salles limité

source: Consider tutors rooms sorts
fr: Prendre en compte les préférences de salles

source: Assign a room to the courses
fr: Affecter une salle aux cours

source: Limit room moves for groups
fr: Limiter les changements de salle des groupes

source: Limit room moves for tutors
fr: Limiter les changements de salle des profs

source: No simultaneous courses for groups
fr: Pas de cours simultanés pour un groupe

source: Group {bg.name} has {group_partition.not_forbidden_duration} available time but requires minimum {min_course_time_needed}.
fr: Le groupe {bg.name} a {group_partition.not_forbidden_duration} minutes de temps disponible mais a besoin de {min_course_time_needed} minimum.

source: Group {bg.name} has {group_partition.not_forbidden_duration} available time but probably requires minimum {course_time_needed}.
fr: Le groupe {bg.name} a {group_partition.not_forbidden_duration} minutes de temps disponible mais a probablement besoin d'un minimum de {course_time_needed} minutes.

source: Group {bg.name} has {allowed_slots_nb} slots available of {course_type.duration} minutes and requires {nb_courses}.
fr: Le groupe {bg.name} a {allowed_slots_nb} créneaux disponibles de {course_type.duration} minutes, et en nécessite {nb_courses}

source: No simultaneous courses for one group
fr: Pas de cours simultanés pour un groupe donné

source: Schedule once all considered courses
fr: Planifie une fois chaque cours considéré

source: Schedule once every considered course
fr: Planifie une fois chaque cours considéré

source: Pre-assigned courses only
fr: Cours pré-assignés seulement

source: Each course is assigned to one tutor (max)
fr: Chaque cours est affecté à un prof (max)

source: Consider tutors' unvailabilities
fr: Prendre en compte les indisponibilités des profs

source: Tutor {tutor} has {tutor_partition.available_duration} minutes of available time.
fr: {tutor} a {tutor_partition.available_duration} minutes de temps disponible

source: He or she has to lecture {len(courses)} classes for an amount of {sum(c.type.duration for c in courses)} minutes of courses.
fr: Il ou elle a {len(courses)} cours pour un total de {sum(c.type.duration for c in courses)} minutes.

source: Tutor {tutor} has {tutor_partition.available_duration} minutes of available time
fr: {tutor} a {tutor_partition.available_duration} minutes de temps disponible

source: (considering that
fr: (sachant que

source: {forbidden_days} is forbidden
fr: {forbidden_days} est exclu

source: and {holiday_text} is holiday).
fr: et {holiday_text} est férié).

source: {holiday_text} is holiday).
fr: {holiday_text} est férié).

source: Tutor {tutor} has {course_partition.nb_slots_available_of_duration_beginning_at(course_type.duration, start_times)} available slots of {course_type.duration} mins
fr: {tutor} a {course_partition.nb_slots_available_of_duration_beginning_at(course_type.duration, start_times)} créneaux disponibles de {course_type.duration} minutes.

source: and {len(course_list)} courses that long to attend.
fr: et {len(course_lits)} cours à donner.

source: Consider tutors unavailability
fr: Prendre en compte les indisponibilités des enseignant⋅e⋅s

source: Limit holes
fr: Limiter les trous

source: Number of weeks
fr: Nombre de semaines

source: Limit time per weeks for tutors
fr: Limiter le temps hebdomadaire des profs

source: Gather courses of considered modules
fr: Regrouper les cours des modules par blocs

source: Minimize busy half-days for groups
fr: Minimise les demies-journées des groupes

source: Minimize groups half-days
fr: Minimise les demies-journées des groupes d'étudiant⋅e⋅s

source: Minimize undesired slots for groups
fr: Minimiser le nombre de créneaux non désirés

source: Minimize groups non-preferred slots
fr: Mininimise les créneaux non-désirés des groupes

source: Limit groups busy time per period
fr: Limiter le nb d'heures par jour (groupes)

source: Limit modules busy time per period
fr: Limiter le nb d'heures par jour (modules)

source: Limit tutors busy time per period
fr: Limiter le nb d'heures par jour (profs)

source: Minimize used half-days for modules
fr: Minimise les demies-journées des modules

source: No courses on declared days for groups
fr: Pas de cours pour les groupes certains jours

source: No courses on declared days for tutors
fr: Pas de cours pour les profs certains jours

source: Lunch break for groups
fr: Pause du midi pour les groupes

source: Lunch break for tutors
fr: Pause du midi pour les profs

source: Not able to eat in other departments on {day}-{week}
fr: Ne pourra pas manger dans un autre département {day}-{week}

source: A break around some type courses
fr: Une pause autour de ce type de cours

source: Simultaneous courses
fr: Cours simultanés

source: Limited start time choices
fr: Choix d'heures de début limité

source: Consider dependecies
fr: Prendre en compte les précédences en base

source: There is no available slots for the second course after the first one. {dependency}
fr: Il n'y a pas de créneaux disponibles pour le deuxième cours après le premier. {dependency}

source: There is no available slots for the first or the second course. {dependency}
fr: Il n'y a pas de créneaux disponibles pour le deuxième cours après le premier. {dependency}

source: There is no available successive slots for those courses. {dependency}
fr: Il n'y a pas de créneaux succéssifs disponibles pour ces cours. {dependency}

source: There is no available slots for the second course after a {dependency.day_gap} day gap. {dependency}
fr: Il n'y a pas de créneaux disponibles pour le second cours {dependency.day_gap} jours après le premier. {dependency}

source: One of the courses has no eligible tutor to lecture it. {dependency}
fr: Un des cours n'a pas de professeur attribué. {dependency}

source: Consider pivots
fr: Prendre en compte les pivots

source: Avoid using both times
fr: Eviter d'utiliser les deux créneaux

source: Tutors
fr: Enseignant⋅e⋅s

source: Limit undesired slots per week
fr: Limiter le nombre de slots non désirés par semaine

source: Limit simultaneous courses number
fr: Limiter le nombre de cours simultanés

source: Stabilize tutors courses
fr: Stabiliser les cours des profs

source: Stabilize groups courses
fr: Stabiliser les cours des groupes

source: Stabilization through weeks
fr: Stabilisation ?

source: tutors
fr: profs

source: Minimize busy half days for tutors
fr: Minimiser les demies-journées de présence des profs

source: Minimize undesired slots for tutors
fr: Minimiser les créneaux non désirés des profs

source: Minimize tutors busy days
fr: Minimise les jours de présence des profs

source: Respect max hours per days bounds
fr: Respecter le nombre max d'heures par jour

source: Respect min hours per day bounds
fr: Respecter le nombre min d'heures par jour

source: Lower bound tutor busy days
fr: Imposer un nombre minimal de jours de présence

source: No visio courses
fr: Interdire les cours en visio

source: Only visio courses
fr: Cours seulement en visio

source: Limit simultaneous physical presence
fr: Limiter le taux d'étudiant⋅e⋅s présents simultanément

source: Bound physical presence half days
fr: Borner les demies-journées de présence

source: Curfew
fr: Couvre-feu

source: Let's start weeks #{self.weeks}
fr: C'est parti pour les semaines suivantes: {self.weeks}

source: Rooms assignment :
fr: Assignation des salles :

source: Will modify only courses of training programme(s) {train_prog}
fr: Ne modifie que les cours des promos {train_prog}

source: Relevant warnings :
fr: Avertissements importants :

source: Reload...
fr: Rechargez...

source: Saved in copy {result_work_copy}
fr: Copié dans la copie {result_work_copy}

source: Impossible to assign rooms
fr: Réassignation impossible

source: Week
fr: Semaine

source: Your e-mail address :
fr: Votre adresse mail :

source: Recipient :
fr: Destinataire :

source: Pseudo : 4 characters max
fr: Pseudo : 4 caractères max

source: Subject of the e-mail :
fr: Sujet du mail

source: 100 characters max
fr: 100 caractères max

source: Body of the message :
fr: Corps du message :

source: This person doesn't exist.
fr: Cette personne n'existe pas.

source: Ideally
fr: Idéalement

source: Basic group?
fr: Groupe basique?

source: Half day
fr: Demie-journée

source: Week number
fr: Numéro de semaine

source: Educative
fr: Educatif

source: Coop. (workplace)
fr: Coop. (poste)

source: Coop. (worker)
fr: Coop. (salarié)

source: Abbreviation
fr: Abbréviation

source: graded?
fr: Noté ?

source: Suspens?
fr: En suspens?

source: Graded?
fr: Noté ?

source: Over time
fr: Temps supplémentaire

source: Successives?
fr: Successifs ?

source: On different days
fr: Des jours différents

source: Minimal day gap between courses
fr: Nombre de jours minimum entre plusieurs cours

source: Full
fr: Totale

source: Full generation date
fr: Date de regénération

source: Stabilized
fr: Stabilisée

source: Partial generation date
fr: Date de regénération partielle

source: Send
fr: Envoyer

source: Please choose your department :
fr: Veuillez choisir votre département :

source: Room modification
fr: Modification de salle

source: Right click on the course in question, the available rooms appear. Click on + to choose a room that is not available for this course. Don't forget to validate any changes.
fr: Cliquer droit sur le cours en question, les salles disponibles apparaissent. Cliquer sur + pour choisir une salle non prévue pour ce cours. Ne pas oublier de valider tout changement.

source: Create an account
fr: Créer un compte

source: Here
fr: Ici

source: Modification of an account
fr: Modifier un compte

source: Click on his nickname (his initials) at the top right of the page.
fr: Cliquer sur son pseudo (ses initiales) en haut à droite de la page.

source: Change password
fr: Mot de passe perdu ?

source: Click on
fr: Click sur

source: this link
fr: ce lien

source: to change your password.
fr: pour changer votre mot de passe.

source: Password reminder
fr: Rappel du mot de passe

source: for a password reminder, or via 'Login' at the top of the page.
fr: pour un rappel de mot de passe, ou via 'Se connecter' en haut de page.

source: Direct link to a particular group
fr: Lien direct vers l'EDT d'un groupe spécifique

source: Add "?promo=...&gp=..." at the end of the url, for example
fr: Ajouter "?promo=...&gp=..." à la fin de l'url, par exemple

source: To know the name of your training programme and group, check the list
fr: Pour connaître le nom de votre promo et de votre groupe, regardez la liste

source: here
fr: ici

source: How availability entry work
fr: Fonctionnement de la saisie des disponibilités

source: When generating the schedule for a given week, if no availability is entered for that week, the typical week defines the availability.
fr: Au moment de la génération de l'emploi du temps d'une semaine donnée, si aucune disponibilité n'est renseignée pour cette semaine, la semaine type définit les disponibilités.

source: Some Tutorial Videos
fr: Quelques Tutos Vidéos

source: Modification of the module description.
fr: Modification de la description du module

source: Modify
fr: Modifier

source: I wish to be notified of changes for the
fr: Je souhaite être notifié⋅e des modifications pour les

source: next weeks.
fr: prochaines semaines.

source: (0 if no notification, 1 for the next 7 days, etc.)
fr: (0 si aucune notification, 1 pour les 7 prochains jours, etc.)

source: Save
fr: Enregistrer

source: Favorite room
fr: Préférences de salles

source: (Ranking your favorite rooms, which may contain ties.)
fr: (Classement de vos salles préférées, pouvant contenir des égalités.)

source: When ?
fr: Quand ?

source: Cancelled class
fr: Cours annulé

source: Pending classes
fr: Cours en attente

source: Course scheduled on week
fr: Cours placé en semaine

source: Why ?
fr: Pourquoi ?

source: (Please fill in the date information)
fr: (Merci de remplir les informations sur la date)

source: Proposals
fr: Propositions

source: How ?
fr: Comment ?

source: Check election
fr: Vérifier élection

source: Elect this copy
fr: Elire cette copie

source: Duplicate this copy
fr: Dupliquer cette copie

source: Delete this copy
fr: Supprimer cette copie

source: Delete all copies except the 0
fr: Supprimer toutes les copies sauf la 0

source: Reassign rooms
fr: Réassigner les salles

source: Duplicate (what can be) in other weeks
fr: Dupliquer (ce qui peut l'être) ailleurs

source: Weeks
fr: Semaines particulières

source: Set default week
fr: Appliquer la configuration ci-contre

source: from week
fr: de la semaine

source: year
fr: année

source: until week
fr: à la semaine

source: button_apply
fr: Appliquer

source: Default week
fr: Semaine type

source: Update my default week
fr: Redéfinir ma semaine type

source: button_save
fr: Sauvegarder

source: My videoconf links
fr: Mes visios

source: Create a link
fr: Créer un lien visio

source: button_change
fr: Modifier

source: My ideal day
fr: Ma journée idéale

source: This is the total number of teaching hours I would like to give every teaching day:
fr: Chaque jour travaillé, voici le nombre d'heures de cours que je souhaite donner :

source: Preferred
fr: Idéalement

source: My favorite rooms
fr: Mes préférences de salles

source: Select my favorite rooms
fr: Choisir mes salles préférées

source: Teachers
fr: Enseignant·e⋅s

source: Transformation in :
fr: Tranformation en :

source: Types of classes
fr: Type de cours

source: Rooms
fr: Salles

source: Number of days of innocuousness per room
fr: Nombre de jours d'innocupation par salle

source: Number of classes given per teacher
fr: Nombre de cours donnés par professeur

source: Your themes is
fr: Votre thème est

source: Create or modify a link
fr: Créer ou modifier un lien

source: Not authorized. New link then.
fr: Non autorisé. Création d'un nouveau lien.

source: Unknown link. New link then.
fr: Lien inconnu. Création d'un nouveau lien.

source: Created
fr: Créé

source: Modified
fr: Modifié

source: Tutor does not exist
fr: L'utilisateur n'existe pas.

source: Mon.
fr: Lun.

source: Tue.
fr: Mar.

source: Wed.
fr: Mer.

source: Thu.
fr: Jeu.

source: Fri.
fr: Ven.

source: Sat.
fr: Sam.

source: Sun.
fr: Dim.

source: Step 1 - Database configuration (teachers, groups, rooms, course types, etc.)
fr: Étape 1 - Configuration de la base de données (profs, groupes, salles, types de cours, etc.)

source: Option A: Using a spreadsheet file
fr: Option A : En utilisant un fichier tableur

source: Configuration file canvas
fr: Canevas du fichier de configuration

source: Download and then complete the file below.
fr: Téléchargez puis remplissez le fichier ci-dessous.

source: Click to download the empty configuration file
fr: Cliquez pour télécharger le fichier de configuration vierge

source: Download
fr: Télécharger

source: Click to make and download a new fullfilled database file
fr: Cliquez pour créer et télécharger un nouveau fichier de configuration rempli

source: (it may last several minuts).
fr: (ça peut prendre plusieurs minutes...)

source: Make_and_download
fr: Créer_et_télécharger

source: Configuration file completed
fr: Fichier de configuration complété

source: Upload the completed configuration file.
fr: Téléversez le fichier de configuration rempli.

source: Only xlsx format is accepted.
fr: Seul le format xlsx est accepté.

source: Department
fr: Département

source: Create
fr: Créer

source: Edit
fr: Modifier

source: Import
fr: Importer

source: Option B: With Flopeditor
fr: Option B : Avec Flopeditor

source: Click here
fr: Cliquer ici

source: to go to Flopeditor.
fr: pour vous rendre sur Flopeditor.

source: If you need help, you can consult the Flopeditor documentation on
fr: Si vous avez besoin d'aide, vous pouvez consulter la documentation de Flopeditor sur

source: this page.
fr: cette page.

source: Step 2 - Plan the lessons (which lesson in which week, which teacher gives which lesson)
fr: Étape 2 - Planifier les cours (quel cours dans quelle semaine, quel prof donne quel cours)

source: Template for the planning file from the configuration file
fr: Canevas du fichier de planification à partir du fichier de configuration

source: Click to download the current planning file outline
fr: Cliquez pour télécharger le canevas de fichier de planification actuel

source: Click to make and download a new blank planning file outline
fr: Cliquez pour créer et télécharger un nouveau canevas de fichier de planification vierge

source: Click to make and download a new fullfilled planning file outline
fr: Cliquez pour créer et télécharger un nouveau canevas de fichier de planification rempli

source: Completed planning file
fr: Fichier de planification des cours complété

source: Upload the completed planning file.
fr: Téléversez le fichier de planification rempli.

source: From week
fr: De la semaine

source: Only for periods
fr: Uniquement les périodes

source: Stabilization ?
fr: Stabilisation ?

source: (Re)assign colors ?
fr: (Ré)assigner les couleurs ?

source: Constraints manager
fr: Gérer les contraintes

source: New Constraint
fr: Nouvelle contrainte

source: Discard Changes
fr: Annuler tout

source: Commit Changes
fr: Enregistrer en base

source: Reload Constraints
fr: Recharger

source: See all weeks
fr: Voir toutes les semaines

source: Clear Filters
fr: Filtres à zéro

source: Gathering :
fr: Regroupement :

source: by status
fr: par statut

source: by class
fr: par classe

source: None
fr: Aucun

source: Edit constraint
fr: Modifier

source: Select type...
fr: Choisir le type...

source: Title
fr: Titre

source: Comment
fr: Commentaire

source: Activated?
fr: Activée ?

source: Cancel
fr: Annuler

source: Save changes
fr: Enregistrer

source: Show Disabled
fr: Montrer les contraintes inactives

source: Preanalyse
fr: Pré-analyse

source: Select all
fr: Sélectionner tout

source: Selected constraints :
fr: Contraintes sélectionnées :

source: Weight
fr: Poids

source: Set weight
fr: Affecter le poids

source: Delete
fr: Supprimer

source: iCal Subscription
fr: Abonnement iCal

source: Copy the corresponding link of the calendar you would like to add to your calendar manager.
fr: Copiez le lien du calendrier qui vous intéresse, et importez-le dans votre gestionnaire d'agenda préféré.

source: Groups
fr: Groupes

source: Structural
fr: Structurels

source: Training program
fr: Promotion

source: Group name
fr: Nom du groupe

source: Copy this link
fr: Copier ce lien

source: Transversal
fr: Transversaux

source: First name
fr: Prénom

source: Last lame
fr: Nom

source: Department(s)
fr: Départements

source: Address
fr: Adresse

source: Name
fr: Nom

source: Planned generations
fr: Générations prévues

source: Deleted
fr: Supprimé

source: Start time
fr: Heure

source: Course Type
fr: Type

source: Tutor
fr: Prof

source: Room
fr: Salle

source: Train_prog
fr: Promo

source: Group
fr: Groupe

source: [flop!Scheduler] Changes on your planning
fr: [flop!EDT] Modifications de votre planning

source: This email is automatically generated by flop!Scheduler. To manage your notifications settings, please <a href='%(url)s/edt/%(dept)s/semaine-type'> click here <a/>.
fr: Ce mail est généré automatiquement par flop!EDT. Pour gérer vos paramètres de notifications, merci de cliquer sur <a href='%(url)s/edt/%(dept)s/semaine-type'> ce lien <a/>.

source: Hi
fr: Bonjour

source: Here are the changes of your planning for the %g following days :
fr: Voici les changements dans votre emploi du temps pour les %g prochains jours :

source: For the department %s :
fr: Concernant le département %s :

source: Forgot password?
fr: Mot de passe perdu ?

source: Sign in
fr: Se connecter

source: Sign up
fr: Nouveau compte

source: I am
fr: Je suis

source: A student
fr: Étudiant·e

source: A teacher
fr: Enseignant·e permanent·e

source: A temporary teacher
fr: Vacataire

source: A tech or administrative staff
fr: BIATS

source: Student Preferences
fr: Préférences des étudiant⋅e⋅s

source: Preferences for your group
fr: Préférences pour votre groupe

source: Morning or evening?
fr: Du matin ou du soir ?

source: Busy days VS Free half-days
fr: Journées chargées VS demie-journées libres

source: Holes?
fr: Les trous

source: Eat early or late?
fr: Manger tôt ou tard ?

source: Not allowed
fr: Non autorisé

source: No such user as {user}
fr: Aucun utilisateur {user}

source: Quote
fr: Citation

source: Last name
fr: Nom

source: First name
fr: Prénom

source: Nickname
fr: Pseudo

source: Author description
fr: Fonction, description<br/> de l'auteur/autrice

source: Header
fr: En-tête

source: Category
fr: Catégorie

source: Schedule Generation
fr: Génération d'EDT

source: Constraints
fr: Contraintes

source: All constraints appearing in bolded - with no weight - will be considered mandatory, the other ones will considered as preferences.
fr: Les contraintes apparaissant en gras - avec un poids non défini - seront prises en compte de manière obligatoire, les autres seront utilisées dans la résolution comme des préférences.

source: Week⋅s
fr: Semaine(s)

source: All weeks together ?
fr: Toutes en une seule fois ?

source: Training Program
fr: Promotion

source: Stabilization
fr: Stabilisation

source: Solver
fr: Solveur

source: Pre-assign rooms
fr: Pré-assigner les salles

source: Post-assign rooms
fr: Post-assigner les salles

source: Time limit (minuts)
fr: Durée limite (min)

source: Unlimited
fr: Illimité

source: Schedule_title
fr: Emplois du temps

source: <span id=flopGreen >flop</span>!<span id=EDTRed >Scheduler</span>
fr: <span id=flopGreen >flop</span>!<span id=EDTRed >EDT</span>

source: Schedule_banner
fr: Consulter

source: Move/Cancel
fr: Décaler/Annuler

source: Preferences
fr: Préférences

source: Help
fr: Aide

source: Messages
fr: Contact

source: Generate
fr: Générer

source: Sign out
fr: Déconnexion

source: Signed in as
fr: Connecté·e sous
